
[
  { "id": "fc_biz_1", "categoryId": "fc_cat_business", "term": "ROI", "definition": "Return on Investment. A performance measure used to evaluate the efficiency of an investment.", "example": "The marketing campaign had a high ROI." },
  { "id": "fc_biz_2", "categoryId": "fc_cat_business", "term": "B2B", "definition": "Business-to-Business. Transactions or business conducted between companies, rather than between a company and individual consumers.", "example": "Their primary sales model is B2B." },
  { "id": "fc_biz_3", "categoryId": "fc_cat_business", "term": "KPI", "definition": "Key Performance Indicator. A measurable value that demonstrates how effectively a company is achieving key business objectives.", "example": "Customer satisfaction is a key KPI for our support team." },
  { "id": "fc_biz_4", "categoryId": "fc_cat_business", "term": "B2C", "definition": "Business-to-Consumer. Transactions or business conducted between a company and individual consumers.", "example": "Amazon's primary model is B2C." },
  { "id": "fc_biz_5", "categoryId": "fc_cat_business", "term": "SWOT Analysis", "definition": "A strategic planning technique used to help an organization identify strengths, weaknesses, opportunities, and threats.", "example": "We conducted a SWOT analysis before launching the new product." },
  { "id": "fc_biz_6", "categoryId": "fc_cat_business", "term": "Venture Capital", "definition": "Financing that investors provide to startup companies and small businesses that are believed to have long-term growth potential.", "example": "The startup secured venture capital funding." },
  { "id": "fc_biz_7", "categoryId": "fc_cat_business", "term": "Stakeholder", "definition": "Any group or individual who can affect or is affected by the achievement of the organization's objectives.", "example": "Employees, customers, and investors are all stakeholders." },
  { "id": "fc_biz_8", "categoryId": "fc_cat_business", "term": "Overhead", "definition": "Ongoing business expenses not directly attributed to creating a product or service.", "example": "Rent and utilities are part of the company's overhead." },
  { "id": "fc_biz_9", "categoryId": "fc_cat_business", "term": "Supply Chain", "definition": "The sequence of processes involved in the production and distribution of a commodity.", "example": "Disruptions in the supply chain can affect product availability." },
  { "id": "fc_biz_10", "categoryId": "fc_cat_business", "term": "Market Share", "definition": "The portion of a market controlled by a particular company or product.", "example": "They aim to increase their market share in the coming year." },
  { "id": "fc_biz_11", "categoryId": "fc_cat_business", "term": "Due Diligence", "definition": "Reasonable steps taken by a person in order to satisfy a legal requirement, especially in buying or selling something.", "example": "The investors performed due diligence before acquiring the company." },
  { "id": "fc_biz_12", "categoryId": "fc_cat_business", "term": "Equity", "definition": "The value of the shares issued by a company.", "example": "Founders often retain a significant amount of equity in their startups." },
  { "id": "fc_biz_13", "categoryId": "fc_cat_business", "term": "Revenue", "definition": "The total amount of income generated by the sale of goods or services related to the company's primary operations.", "example": "The company's annual revenue exceeded $10 million." },
  { "id": "fc_biz_14", "categoryId": "fc_cat_business", "term": "Profit Margin", "definition": "A measure of profitability, calculated as net income divided by revenue.", "example": "A healthy profit margin is essential for long-term sustainability." },
  { "id": "fc_biz_15", "categoryId": "fc_cat_business", "term": "Brand Equity", "definition": "The value premium that a company generates from a product with a recognizable name when compared to a generic equivalent.", "example": "Coca-Cola has strong brand equity." },
  { "id": "fc_biz_16", "categoryId": "fc_cat_business", "term": "Liability", "definition": "A company's legal financial debts or obligations that arise during the course of business operations.", "example": "Accounts payable is a common current liability." },
  { "id": "fc_biz_17", "categoryId": "fc_cat_business", "term": "Asset", "definition": "A resource with economic value that an individual, corporation, or country owns or controls with the expectation that it will provide a future benefit.", "example": "Cash, equipment, and intellectual property are all assets." },
  { "id": "fc_biz_18", "categoryId": "fc_cat_business", "term": "Balance Sheet", "definition": "A financial statement that reports a company's assets, liabilities, and shareholders' equity at a specific point in time.", "example": "The balance sheet provides a snapshot of the company's financial health." },
  { "id": "fc_biz_19", "categoryId": "fc_cat_business", "term": "Income Statement", "definition": "A financial statement that reports a company's financial performance over a specific accounting period. Also known as a profit and loss (P&L) statement.", "example": "The income statement shows the company's revenues and expenses." },
  { "id": "fc_biz_20", "categoryId": "fc_cat_business", "term": "Cash Flow Statement", "definition": "A financial statement that summarizes the amount of cash and cash equivalents entering and leaving a company.", "example": "The cash flow statement tracks the movement of cash from operations, investing, and financing." },
  { "id": "fc_biz_21", "categoryId": "fc_cat_business", "term": "Startup", "definition": "A young company founded by one or more entrepreneurs to develop a unique product or service and bring it to market.", "example": "Many startups seek funding to scale their operations." },
  { "id": "fc_biz_22", "categoryId": "fc_cat_business", "term": "Entrepreneur", "definition": "An individual who creates a new business, bearing most of the risks and enjoying most of the rewards.", "example": "Successful entrepreneurs often possess strong vision and resilience." },
  { "id": "fc_biz_23", "categoryId": "fc_cat_business", "term": "Merger", "definition": "The combination of two or more companies into a single larger company.", "example": "The merger created a new industry leader." },
  { "id": "fc_biz_24", "categoryId": "fc_cat_business", "term": "Acquisition", "definition": "A corporate action in which one company purchases most or all of another company's shares to gain control of that company.", "example": "The tech giant announced the acquisition of a smaller startup." },
  { "id": "fc_biz_25", "categoryId": "fc_cat_business", "term": "Franchise", "definition": "A type of license that grants a franchisee access to a franchisor's proprietary business knowledge, processes, and trademarks.", "example": "McDonald's is a well-known franchise." },
  { "id": "fc_biz_26", "categoryId": "fc_cat_business", "term": "Outsourcing", "definition": "The business practice of hiring a party outside a company to perform services or create goods that were traditionally performed in-house.", "example": "Many companies outsource their customer support." },
  { "id": "fc_biz_27", "categoryId": "fc_cat_business", "term": "Globalization", "definition": "The process by which businesses or other organizations develop international influence or start operating on an international scale.", "example": "Globalization has led to increased international trade." },
  { "id": "fc_biz_28", "categoryId": "fc_cat_business", "term": "Logistics", "definition": "The detailed coordination of a complex operation involving many people, facilities, or supplies.", "example": "Efficient logistics are crucial for e-commerce businesses." },
  { "id": "fc_biz_29", "categoryId": "fc_cat_business", "term": "Demographics", "definition": "Statistical data relating to the population and particular groups within it.", "example": "Marketers use demographics to target specific customer segments." },
  { "id": "fc_biz_30", "categoryId": "fc_cat_business", "term": "Target Market", "definition": "A particular group of consumers at which a product or service is aimed.", "example": "Their target market is young professionals aged 25-35." },
  { "id": "fc_biz_31", "categoryId": "fc_cat_business", "term": "Unique Selling Proposition (USP)", "definition": "The factor or consideration presented by a seller as the reason that one product or service is different from and better than that of the competition.", "example": "Their USP is their commitment to sustainable materials." },
  { "id": "fc_biz_32", "categoryId": "fc_cat_business", "term": "Value Proposition", "definition": "A promise of value to be delivered, communicated, and acknowledged. It is also a belief from the customer about how value will be delivered, experienced and acquired.", "example": "A strong value proposition clearly articulates the benefits to the customer." },
  { "id": "fc_biz_33", "categoryId": "fc_cat_business", "term": "Business Model", "definition": "A company's plan for making a profit. It identifies the products or services the business plans to sell, its identified target market, and any anticipated expenses.", "example": "Subscription-based services are a popular business model." },
  { "id": "fc_biz_34", "categoryId": "fc_cat_business", "term": "Scalability", "definition": "The capability of a system, network, or process to handle a growing amount of work, or its potential to be enlarged to accommodate that growth.", "example": "The software was designed for scalability to support future user growth." },
  { "id": "fc_biz_35", "categoryId": "fc_cat_business", "term": "Sustainability", "definition": "In business, sustainability refers to doing business without negatively impacting the environment, community, or society as a whole.", "example": "Many corporations are now focusing on sustainability initiatives." },
  { "id": "fc_biz_36", "categoryId": "fc_cat_business", "term": "Corporate Social Responsibility (CSR)", "definition": "A self-regulating business model that helps a company be socially accountable—to itself, its stakeholders, and the public.", "example": "CSR initiatives can include charitable donations and ethical labor practices." },
  { "id": "fc_biz_37", "categoryId": "fc_cat_business", "term": "Networking", "definition": "Interacting with other people to exchange information and develop contacts, especially to further one's career.", "example": "Industry conferences are great for networking." },
  { "id": "fc_biz_38", "categoryId": "fc_cat_business", "term": "Human Resources (HR)", "definition": "The department of a business or organization that deals with the hiring, administration, and training of personnel.", "example": "HR is responsible for employee relations and recruitment." },
  { "id": "fc_biz_39", "categoryId": "fc_cat_business", "term": "Operations Management", "definition": "The administration of business practices to create the highest level of efficiency possible within an organization.", "example": "Operations management focuses on converting materials and labor into goods and services." },
  { "id": "fc_biz_40", "categoryId": "fc_cat_business", "term": "Market Research", "definition": "The action or activity of gathering information about consumers' needs and preferences.", "example": "Market research helps businesses understand their customers better." },
  { "id": "fc_biz_41", "categoryId": "fc_cat_business", "term": "Public Relations (PR)", "definition": "The professional maintenance of a favorable public image by a company or other organization or a famous person.", "example": "PR activities include media outreach and press releases." },
  { "id": "fc_biz_42", "categoryId": "fc_cat_business", "term": "Risk Management", "definition": "The forecasting and evaluation of financial risks together with the identification of procedures to avoid or minimize their impact.", "example": "Risk management is essential for financial stability." },
  { "id": "fc_biz_43", "categoryId": "fc_cat_business", "term": "Consultant", "definition": "A person who provides expert advice professionally.", "example": "The company hired a consultant to improve their marketing strategy." },
  { "id": "fc_biz_44", "categoryId": "fc_cat_business", "term": "Angel Investor", "definition": "An affluent individual who provides capital for a business start-up, usually in exchange for convertible debt or ownership equity.", "example": "The startup received initial funding from an angel investor." },
  { "id": "fc_biz_45", "categoryId": "fc_cat_business", "term": "Pitch Deck", "definition": "A brief presentation, often created using PowerPoint, Keynote, or Prezi, used to provide your audience with a quick overview of your business plan.", "example": "Entrepreneurs use a pitch deck to present to potential investors." },
  { "id": "fc_biz_46", "categoryId": "fc_cat_business", "term": "Intellectual Property (IP)", "definition": "Creations of the mind, such as inventions; literary and artistic works; designs; and symbols, names and images used in commerce.", "example": "Patents, trademarks, and copyrights protect intellectual property." },
  { "id": "fc_biz_47", "categoryId": "fc_cat_business", "term": "Gross Profit", "definition": "The profit a company makes after deducting the costs associated with making and selling its products, or the costs associated with providing its services.", "example": "Gross profit is calculated as revenue minus cost of goods sold." },
  { "id": "fc_biz_48", "categoryId": "fc_cat_business", "term": "Net Profit", "definition": "The actual profit after working expenses not included in the calculation of gross profit have been paid.", "example": "Net profit is the bottom line for a business." },
  { "id": "fc_biz_49", "categoryId": "fc_cat_business", "term": "Fiscal Year", "definition": "A year as reckoned for taxing or accounting purposes.", "example": "Many companies have a fiscal year that ends on December 31st." },
  { "id": "fc_biz_50", "categoryId": "fc_cat_business", "term": "Quarter (Q1, Q2, Q3, Q4)", "definition": "A three-month period on a company's financial calendar that acts as a basis for reporting earnings and paying dividends.", "example": "The company reported strong earnings in Q3." },
  { "id": "fc_biz_51", "categoryId": "fc_cat_business", "term": "EBITDA", "definition": "Earnings Before Interest, Taxes, Depreciation, and Amortization. A measure of a company's overall financial performance.", "example": "EBITDA is often used as an alternative to net income." },
  { "id": "fc_biz_52", "categoryId": "fc_cat_business", "term": "Blue Ocean Strategy", "definition": "The simultaneous pursuit of differentiation and low cost to open up a new market space and create new demand.", "example": "Cirque du Soleil is an example of a blue ocean strategy." },
  { "id": "fc_biz_53", "categoryId": "fc_cat_business", "term": "Red Ocean Strategy", "definition": "Competing in existing market space, beating the competition, exploiting existing demand, and making the value-cost trade-off.", "example": "Many companies operate in red oceans with intense competition." },
  { "id": "fc_biz_54", "categoryId": "fc_cat_business", "term": "Lean Startup", "definition": "A methodology for developing businesses and products that aims to shorten product development cycles and rapidly discover if a proposed business model is viable.", "example": "The lean startup approach emphasizes iterative development and customer feedback." },
  { "id": "fc_biz_55", "categoryId": "fc_cat_business", "term": "Minimum Viable Product (MVP)", "definition": "A version of a new product which allows a team to collect the maximum amount of validated learning about customers with the least effort.", "example": "They launched an MVP to test their core assumptions." },
  { "id": "fc_biz_56", "categoryId": "fc_cat_business", "term": "Pivot", "definition": "A structured course correction designed to test a new fundamental hypothesis about the product, strategy, and engine of growth.", "example": "The company decided to pivot after their initial product failed to gain traction." },
  { "id": "fc_biz_57", "categoryId": "fc_cat_business", "term": "Business Plan", "definition": "A formal written document containing business goals, the methods on how these goals can be attained, and the time frame within which these goals need to be achieved.", "example": "A well-structured business plan is crucial for securing funding." },
  { "id": "fc_biz_58", "categoryId": "fc_cat_business", "term": "Break-Even Point", "definition": "The point at which total cost and total revenue are equal, meaning there is no net loss or gain.", "example": "The company needs to sell 1,000 units to reach its break-even point." },
  { "id": "fc_biz_59", "categoryId": "fc_cat_business", "term": "Competitive Advantage", "definition": "A condition or circumstance that puts a company in a favorable or superior business position.", "example": "Strong brand recognition can be a significant competitive advantage." },
  { "id": "fc_biz_60", "categoryId": "fc_cat_business", "term": "Core Competency", "definition": "A harmonized combination of multiple resources and skills that distinguish a firm in the marketplace.", "example": "Innovation is a core competency of Apple." },
  { "id": "fc_biz_61", "categoryId": "fc_cat_business", "term": "Economies of Scale", "definition": "Cost advantages reaped by companies when production becomes efficient. Companies can achieve economies of scale by increasing production and lowering costs.", "example": "Large manufacturers benefit from economies of scale." },
  { "id": "fc_biz_62", "categoryId": "fc_cat_business", "term": "Market Segmentation", "definition": "The process of dividing a broad consumer or business market, normally consisting of existing and potential customers, into sub-groups of consumers based on some type of shared characteristics.", "example": "Market segmentation helps tailor marketing efforts." },
  { "id": "fc_biz_63", "categoryId": "fc_cat_business", "term": "Niche Market", "definition": "A small, specialized market for a particular product or service.", "example": "They found success by targeting a niche market of eco-conscious consumers." },
  { "id": "fc_biz_64", "categoryId": "fc_cat_business", "term": "Joint Venture", "definition": "A business arrangement in which two or more parties agree to pool their resources for the purpose of accomplishing a specific task.", "example": "The two companies formed a joint venture to develop new technology." },
  { "id": "fc_biz_65", "categoryId": "fc_cat_business", "term": "Strategic Alliance", "definition": "An agreement between two or more parties to pursue a set of agreed upon objectives needed while remaining independent organizations.", "example": "Airlines often form strategic alliances to expand their route networks." },
  { "id": "fc_biz_66", "categoryId": "fc_cat_business", "term": "Brand Loyalty", "definition": "The tendency of consumers to continuously purchase one brand's products over another.", "example": "Apple has built strong brand loyalty among its users." },
  { "id": "fc_biz_67", "categoryId": "fc_cat_business", "term": "Capital", "definition": "Financial assets or the financial value of assets, such as cash and factories.", "example": "The company raised capital to fund its expansion." },
  { "id": "fc_biz_68", "categoryId": "fc_cat_business", "term": "Cost of Goods Sold (COGS)", "definition": "The direct costs of producing the goods sold by a company. This amount includes the cost of the materials and labor directly used to create the good.", "example": "Subtracting COGS from revenue gives the gross profit." },
  { "id": "fc_biz_69", "categoryId": "fc_cat_business", "term": "Depreciation", "definition": "An accounting method of allocating the cost of a tangible asset over its useful life.", "example": "The company accounts for depreciation of its equipment annually." },
  { "id": "fc_biz_70", "categoryId": "fc_cat_business", "term": "Fixed Costs", "definition": "Business costs, such as rent, that are constant whatever the quantity of goods or services produced.", "example": "Salaries and rent are examples of fixed costs." },
  { "id": "fc_biz_71", "categoryId": "fc_cat_business", "term": "Variable Costs", "definition": "Costs that change in proportion to the activity of a business.", "example": "Raw materials are a variable cost for manufacturers." },
  { "id": "fc_biz_72", "categoryId": "fc_cat_business", "term": "Liquidity", "definition": "The availability of liquid assets to a market or company; liquid assets are cash and assets that can be quickly converted to cash.", "example": "The company has enough liquidity to cover its short-term debts." },
  { "id": "fc_biz_73", "categoryId": "fc_cat_business", "term": "Go-to-Market Strategy (GTM)", "definition": "An action plan that specifies how a company will reach target customers and achieve competitive advantage.", "example": "Their GTM strategy focuses on content marketing and direct sales." },
  { "id": "fc_biz_74", "categoryId": "fc_cat_business", "term": "Product-Market Fit", "definition": "Being in a good market with a product that can satisfy that market.", "example": "Achieving product-market fit is a key milestone for startups." },
  { "id": "fc_biz_75", "categoryId": "fc_cat_business", "term": "Freemium", "definition": "A business model that offers basic services for free, while charging a premium for advanced or additional features.", "example": "Spotify uses a freemium model." }
]
