
[
  { "id": "fc_biz_1", "categoryId": "fc_cat_business", "term": "ROI", "definition": "Return on Investment. A performance measure used to evaluate the efficiency of an investment.", "example": "The marketing campaign had a high ROI." },
  { "id": "fc_biz_2", "categoryId": "fc_cat_business", "term": "B2B", "definition": "Business-to-Business. Transactions or business conducted between companies, rather than between a company and individual consumers.", "example": "Their primary sales model is B2B." },
  { "id": "fc_biz_3", "categoryId": "fc_cat_business", "term": "KPI", "definition": "Key Performance Indicator. A measurable value that demonstrates how effectively a company is achieving key business objectives.", "example": "Customer satisfaction is a key KPI for our support team." },
  { "id": "fc_biz_4", "categoryId": "fc_cat_business", "term": "B2C", "definition": "Business-to-Consumer. Transactions or business conducted between a company and individual consumers.", "example": "Amazon's primary model is B2C." },
  { "id": "fc_biz_5", "categoryId": "fc_cat_business", "term": "SWOT Analysis", "definition": "A strategic planning technique used to help an organization identify strengths, weaknesses, opportunities, and threats.", "example": "We conducted a SWOT analysis before launching the new product." },
  { "id": "fc_biz_6", "categoryId": "fc_cat_business", "term": "Venture Capital", "definition": "Financing that investors provide to startup companies and small businesses that are believed to have long-term growth potential.", "example": "The startup secured venture capital funding." },
  { "id": "fc_biz_7", "categoryId": "fc_cat_business", "term": "Stakeholder", "definition": "Any group or individual who can affect or is affected by the achievement of the organization's objectives.", "example": "Employees, customers, and investors are all stakeholders." },
  { "id": "fc_biz_8", "categoryId": "fc_cat_business", "term": "Overhead", "definition": "Ongoing business expenses not directly attributed to creating a product or service.", "example": "Rent and utilities are part of the company's overhead." },
  { "id": "fc_biz_9", "categoryId": "fc_cat_business", "term": "Supply Chain", "definition": "The sequence of processes involved in the production and distribution of a commodity.", "example": "Disruptions in the supply chain can affect product availability." },
  { "id": "fc_biz_10", "categoryId": "fc_cat_business", "term": "Market Share", "definition": "The portion of a market controlled by a particular company or product.", "example": "They aim to increase their market share in the coming year." },
  { "id": "fc_biz_11", "categoryId": "fc_cat_business", "term": "Due Diligence", "definition": "Reasonable steps taken by a person in order to satisfy a legal requirement, especially in buying or selling something.", "example": "The investors performed due diligence before acquiring the company." },
  { "id": "fc_biz_12", "categoryId": "fc_cat_business", "term": "Equity", "definition": "The value of the shares issued by a company.", "example": "Founders often retain a significant amount of equity in their startups." },
  { "id": "fc_biz_13", "categoryId": "fc_cat_business", "term": "Revenue", "definition": "The total amount of income generated by the sale of goods or services related to the company's primary operations.", "example": "The company's annual revenue exceeded $10 million." },
  { "id": "fc_biz_14", "categoryId": "fc_cat_business", "term": "Profit Margin", "definition": "A measure of profitability, calculated as net income divided by revenue.", "example": "A healthy profit margin is essential for long-term sustainability." },
  { "id": "fc_biz_15", "categoryId": "fc_cat_business", "term": "Brand Equity", "definition": "The value premium that a company generates from a product with a recognizable name when compared to a generic equivalent.", "example": "Coca-Cola has strong brand equity." }
]
