
[
  { "id": "fc_dm_1", "categoryId": "fc_cat_digital_marketing", "term": "SEO", "definition": "Search Engine Optimization. The process of improving the quality and quantity of website traffic to a website or a web page from search engines.", "example": "Good SEO is crucial for organic growth." },
  { "id": "fc_dm_2", "categoryId": "fc_cat_digital_marketing", "term": "CTR", "definition": "Click-Through Rate. The ratio of users who click on a specific link to the number of total users who view a page, email, or advertisement.", "example": "The ad campaign had a low CTR." },
  { "id": "fc_dm_3", "categoryId": "fc_cat_digital_marketing", "term": "PPC", "definition": "Pay-Per-Click. An internet advertising model used to drive traffic to websites, in which an advertiser pays a publisher when the ad is clicked.", "example": "They invested heavily in PPC advertising." },
  { "id": "fc_dm_4", "categoryId": "fc_cat_digital_marketing", "term": "Content Marketing", "definition": "A marketing strategy focused on creating and distributing valuable, relevant, and consistent content to attract and retain a clearly defined audience.", "example": "Blogging is a common form of content marketing." },
  { "id": "fc_dm_5", "categoryId": "fc_cat_digital_marketing", "term": "A/B Testing", "definition": "A method of comparing two versions of a webpage or app against each other to determine which one performs better.", "example": "We're A/B testing two different call-to-action buttons." },
  { "id": "fc_dm_6", "categoryId": "fc_cat_digital_marketing", "term": "Conversion Rate", "definition": "The percentage of users who take a desired action (e.g., making a purchase, signing up for a newsletter).", "example": "Improving the landing page design increased the conversion rate." },
  { "id": "fc_dm_7", "categoryId": "fc_cat_digital_marketing", "term": "SERP", "definition": "Search Engine Results Page. The page displayed by a search engine in response to a query by a searcher.", "example": "Our goal is to rank on the first SERP for relevant keywords." },
  { "id": "fc_dm_8", "categoryId": "fc_cat_digital_marketing", "term": "Backlink", "definition": "An incoming hyperlink from one web page to another website.", "example": "High-quality backlinks can improve SEO." },
  { "id": "fc_dm_9", "categoryId": "fc_cat_digital_marketing", "term": "Affiliate Marketing", "definition": "A marketing arrangement by which an online retailer pays commission to an external website for traffic or sales generated from its referrals.", "example": "She earns income through affiliate marketing on her blog." },
  { "id": "fc_dm_10", "categoryId": "fc_cat_digital_marketing", "term": "Email Automation", "definition": "The process of sending targeted, triggered emails to subscribers at specific times or after specific actions.", "example": "Welcome emails are part of our email automation strategy." },
  { "id": "fc_dm_11", "categoryId": "fc_cat_digital_marketing", "term": "Funnel (Marketing)", "definition": "A visual representation of the customer journey, from initial awareness to conversion or purchase.", "example": "We're optimizing each stage of our marketing funnel." },
  { "id": "fc_dm_12", "categoryId": "fc_cat_digital_marketing", "term": "Influencer", "definition": "An individual who has the power to affect purchase decisions of others because of their authority, knowledge, position, or relationship with their audience.", "example": "Partnering with an influencer can expand brand reach." },
  { "id": "fc_dm_13", "categoryId": "fc_cat_digital_marketing", "term": "Lead Generation", "definition": "The process of attracting and converting strangers and prospects into someone who has indicated interest in your company's product or service.", "example": "Our latest webinar was effective for lead generation." },
  { "id": "fc_dm_14", "categoryId": "fc_cat_digital_marketing", "term": "CTA", "definition": "Call to Action. An instruction to the audience designed to provoke an immediate response, usually using an imperative verb such as 'call now', 'find out more' or 'visit a store today'.", "example": "The 'Sign Up Now' button is our main CTA." },
  { "id": "fc_dm_15", "categoryId": "fc_cat_digital_marketing", "term": "Landing Page", "definition": "A standalone web page, created specifically for a marketing or advertising campaign. It’s where a visitor “lands” after they click on a link in an email, or ads from Google, Bing, YouTube, Facebook, Instagram, Twitter, or similar places on the web.", "example": "We created a dedicated landing page for the new product launch." },
  { "id": "fc_dm_16", "categoryId": "fc_cat_digital_marketing", "term": "Bounce Rate", "definition": "The percentage of visitors to a particular website who navigate away from the site after viewing only one page.", "example": "A high bounce rate can indicate poor user experience." },
  { "id": "fc_dm_17", "categoryId": "fc_cat_digital_marketing", "term": "Keyword Research", "definition": "The process of finding and analyzing actual search terms that people enter into search engines.", "example": "Keyword research is fundamental to SEO and content strategy." },
  { "id": "fc_dm_18", "categoryId": "fc_cat_digital_marketing", "term": "Social Media Marketing (SMM)", "definition": "The use of social media platforms and websites to promote a product or service.", "example": "Instagram and Facebook are key SMM channels for many brands." },
  { "id": "fc_dm_19", "categoryId": "fc_cat_digital_marketing", "term": "Impressions", "definition": "The number of times an ad or piece of content is displayed, no matter if it was clicked or not.", "example": "The ad received 10,000 impressions." },
  { "id": "fc_dm_20", "categoryId": "fc_cat_digital_marketing", "term": "Reach", "definition": "The total number of unique people who see your content.", "example": "Our latest post had a reach of 5,000 users." },
  { "id": "fc_dm_21", "categoryId": "fc_cat_digital_marketing", "term": "Engagement Rate", "definition": "A metric that measures the level of engagement that a piece of content is receiving from an audience. It shows how much people interact with the content.", "example": "High engagement rates often correlate with better reach." },
  { "id": "fc_dm_22", "categoryId": "fc_cat_digital_marketing", "term": "Organic Traffic", "definition": "Visitors who come to your website from unpaid search results.", "example": "SEO efforts aim to increase organic traffic." },
  { "id": "fc_dm_23", "categoryId": "fc_cat_digital_marketing", "term": "Paid Traffic", "definition": "Visitors who come to your website from paid advertisements, such as PPC campaigns.", "example": "We allocate a budget for paid traffic generation." },
  { "id": "fc_dm_24", "categoryId": "fc_cat_digital_marketing", "term": "Remarketing/Retargeting", "definition": "A form of online advertising that can help you keep your brand in front of bounced traffic after they leave your website.", "example": "Retargeting ads are shown to users who previously visited our site." },
  { "id": "fc_dm_25", "categoryId": "fc_cat_digital_marketing", "term": "Marketing Automation", "definition": "Technology that manages marketing processes and multifunctional campaigns, across multiple channels, automatically.", "example": "Marketing automation tools can handle email sequences and lead nurturing." },
  { "id": "fc_dm_26", "categoryId": "fc_cat_digital_marketing", "term": "Customer Relationship Management (CRM)", "definition": "Technology for managing all your company's relationships and interactions with customers and potential customers.", "example": "Salesforce is a widely used CRM system." },
  { "id": "fc_dm_27", "categoryId": "fc_cat_digital_marketing", "term": "User Generated Content (UGC)", "definition": "Any form of content, such as images, videos, text, and audio, that has been posted by users on online platforms.", "example": "Running a contest can encourage user-generated content." },
  { "id": "fc_dm_28", "categoryId": "fc_cat_digital_marketing", "term": "Domain Authority (DA)", "definition": "A search engine ranking score developed by Moz that predicts how well a website will rank on search engine result pages (SERPs).", "example": "Building high-quality backlinks can increase domain authority." },
  { "id": "fc_dm_29", "categoryId": "fc_cat_digital_marketing", "term": "Page Authority (PA)", "definition": "A score developed by Moz that predicts how well a specific page will rank on search engine result pages (SERP).", "example": "Optimizing on-page content can improve page authority." },
  { "id": "fc_dm_30", "categoryId": "fc_cat_digital_marketing", "term": "Google Analytics", "definition": "A web analytics service offered by Google that tracks and reports website traffic.", "example": "We use Google Analytics to monitor user behavior on our site." },
  { "id": "fc_dm_31", "categoryId": "fc_cat_digital_marketing", "term": "Heatmap", "definition": "A graphical representation of data where values are depicted by color, often used to show where users click or scroll on a webpage.", "example": "Heatmaps revealed that users weren't seeing the CTA button." },
  { "id": "fc_dm_32", "categoryId": "fc_cat_digital_marketing", "term": "Cost Per Click (CPC)", "definition": "The actual price you pay for each click in your pay-per-click (PPC) marketing campaigns.", "example": "Our average CPC for this keyword is $1.50." },
  { "id": "fc_dm_33", "categoryId": "fc_cat_digital_marketing", "term": "Cost Per Acquisition (CPA)", "definition": "A metric that measures the aggregate cost to acquire one paying customer on a campaign or channel level.", "example": "A lower CPA indicates a more efficient marketing spend." },
  { "id": "fc_dm_34", "categoryId": "fc_cat_digital_marketing", "term": "Return on Ad Spend (ROAS)", "definition": "A marketing metric that measures the amount of revenue your business earns for each dollar it spends on advertising.", "example": "A ROAS of 5:1 means you earn $5 for every $1 spent on ads." },
  { "id": "fc_dm_35", "categoryId": "fc_cat_digital_marketing", "term": "Keyphrase/Keyword", "definition": "The words and phrases that searchers type into search engines. These are also the terms that businesses target in their SEO and PPC efforts.", "example": "Long-tail keywords can attract highly qualified traffic." },
  { "id": "fc_dm_36", "categoryId": "fc_cat_digital_marketing", "term": "Metadata (Meta Tags)", "definition": "Snippets of text that describe a page's content; the meta tags don't appear on the page itself, but only in the page's code.", "example": "Meta descriptions can influence click-through rates from SERPs." },
  { "id": "fc_dm_37", "categoryId": "fc_cat_digital_marketing", "term": "Mobile Optimization", "definition": "Ensuring that visitors who access your site from mobile devices have an experience optimized for the device.", "example": "Mobile optimization is crucial as a majority of web traffic comes from mobile." },
  { "id": "fc_dm_38", "categoryId": "fc_cat_digital_marketing", "term": "Responsive Web Design", "definition": "A web design approach that makes web pages render well on a variety of devices and window or screen sizes.", "example": "Responsive web design adapts layouts to fit desktops, tablets, and smartphones." },
  { "id": "fc_dm_39", "categoryId": "fc_cat_digital_marketing", "term": "Sitemap", "definition": "A file where you provide information about the pages, videos, and other files on your site, and the relationships between them.", "example": "Submitting a sitemap to Google helps with crawling and indexing." },
  { "id": "fc_dm_40", "categoryId": "fc_cat_digital_marketing", "term": "Webinar", "definition": "An online seminar or other presentation that takes place on the internet, allowing participants in different locations to see and hear the presenter, ask questions, and sometimes answer polls.", "example": "Webinars are a great tool for lead generation and education." },
  { "id": "fc_dm_41", "categoryId": "fc_cat_digital_marketing", "term": "Podcast", "definition": "An episodic series of spoken word digital audio files that a user can download to a personal device for easy listening.", "example": "Many businesses use podcasts for content marketing." },
  { "id": "fc_dm_42", "categoryId": "fc_cat_digital_marketing", "term": "Infographic", "definition": "A visual representation of information or data, e.g. as a chart or diagram.", "example": "Infographics can make complex data easier to understand." },
  { "id": "fc_dm_43", "categoryId": "fc_cat_digital_marketing", "term": "Evergreen Content", "definition": "Content that remains relevant and valuable for a long period, not tied to specific current events.", "example": "How-to guides are often evergreen content." },
  { "id": "fc_dm_44", "categoryId": "fc_cat_digital_marketing", "term": "Drip Campaign", "definition": "A method used in direct marketing to acquire customers through lead nurture programs. It involves sending marketing information to prospects repeatedly over longer periods of time.", "example": "A drip campaign can nurture leads through the sales funnel." },
  { "id": "fc_dm_45", "categoryId": "fc_cat_digital_marketing", "term": "Buyer Persona", "definition": "A semi-fictional representation of your ideal customer based on market research and real data about your existing customers.", "example": "Understanding your buyer persona helps tailor marketing messages." },
  { "id": "fc_dm_46", "categoryId": "fc_cat_digital_marketing", "term": "Lead Nurturing", "definition": "The process of developing relationships with buyers at every stage of the sales funnel, and through every step of the buyer's journey.", "example": "Lead nurturing aims to convert prospects into customers." },
  { "id": "fc_dm_47", "categoryId": "fc_cat_digital_marketing", "term": "Sales Funnel", "definition": "The marketing term for the journey potential customers go through on the way to purchase. There are several steps to a sales funnel, usually known as the top, middle, and bottom of the funnel.", "example": "Different content types are suitable for different stages of the sales funnel." },
  { "id": "fc_dm_48", "categoryId": "fc_cat_digital_marketing", "term": "Link Building", "definition": "The process of acquiring hyperlinks from other websites to your own.", "example": "Quality link building is an important off-page SEO factor." },
  { "id": "fc_dm_49", "categoryId": "fc_cat_digital_marketing", "term": "Page Speed", "definition": "The length of time it takes for a web page to load. Page speed is a ranking factor for Google.", "example": "Optimizing images can improve page speed." },
  { "id": "fc_dm_50", "categoryId": "fc_cat_digital_marketing", "term": "Customer Lifetime Value (CLV/LTV)", "definition": "A prediction of the net profit attributed to the entire future relationship with a customer.", "example": "Increasing CLV is a key goal for subscription businesses." },
  { "id": "fc_dm_51", "categoryId": "fc_cat_digital_marketing", "term": "Growth Hacking", "definition": "A process of rapid experimentation across marketing channels and product development to identify the most efficient ways to grow a business.", "example": "Growth hacking often involves unconventional and low-cost strategies." },
  { "id": "fc_dm_52", "categoryId": "fc_cat_digital_marketing", "term": "Vanity Metric", "definition": "Metrics that look good on paper but don't actually help you understand your own performance in a way that informs future strategies.", "example": "Total page views can be a vanity metric if not correlated with engagement." },
  { "id": "fc_dm_53", "categoryId": "fc_cat_digital_marketing", "term": "Actionable Metric", "definition": "Metrics that tie specific and repeatable actions to observed results. They help you make informed business decisions.", "example": "Conversion rate per traffic source is an actionable metric." },
  { "id": "fc_dm_54", "categoryId": "fc_cat_digital_marketing", "term": "Gamification", "definition": "The application of typical elements of game playing (e.g. point scoring, competition with others, rules of play) to other areas of activity, typically as an online marketing technique to encourage engagement with a product or service.", "example": "Loyalty programs often use gamification elements." },
  { "id": "fc_dm_55", "categoryId": "fc_cat_digital_marketing", "term": "Personalization", "definition": "Tailoring content, offers, and experiences to individual users based on their data and behavior.", "example": "Personalization can significantly improve user engagement and conversion rates." },
  { "id": "fc_dm_56", "categoryId": "fc_cat_digital_marketing", "term": "Chatbot", "definition": "A computer program designed to simulate human conversation through voice commands or text chats or both.", "example": "Chatbots can provide 24/7 customer support for simple queries." },
  { "id": "fc_dm_57", "categoryId": "fc_cat_digital_marketing", "term": "Content Curation", "definition": "The process of gathering information relevant to a particular topic or area of interest, usually with the intention of adding value through organization and commentary.", "example": "Content curation can supplement original content creation." },
  { "id": "fc_dm_58", "categoryId": "fc_cat_digital_marketing", "term": "Dark Social", "definition": "Web traffic that comes from outside sources that web analytics are unable to track, such as sharing content via email or messaging apps.", "example": "Dark social sharing can be significant but is hard to measure directly." },
  { "id": "fc_dm_59", "categoryId": "fc_cat_digital_marketing", "term": "Gated Content", "definition": "Online materials, such as white papers, articles, and videos, that require users to fill out a form before they can access them.", "example": "Gated content is often used for lead generation." },
  { "id": "fc_dm_60", "categoryId": "fc_cat_digital_marketing", "term": "Native Advertising", "definition": "Paid ads that are so cohesive with the page content, assimilated into the design, and consistent with the platform behavior that the viewer feels the ad belongs there.", "example": "Sponsored content articles are a form of native advertising." },
  { "id": "fc_dm_61", "categoryId": "fc_cat_digital_marketing", "term": "Programmatic Advertising", "definition": "The automated buying and selling of online advertising.", "example": "Programmatic advertising uses AI to optimize ad placements in real-time." },
  { "id": "fc_dm_62", "categoryId": "fc_cat_digital_marketing", "term": "Rich Snippets", "definition": "Structured data markup that site operators can add to their existing HTML, which in turn allows search engines to better understand what information is contained on each web page.", "example": "Recipe sites often use rich snippets to show ratings and cook times in search results." },
  { "id": "fc_dm_63", "categoryId": "fc_cat_digital_marketing", "term": "User Intent (Search Intent)", "definition": "The goal a user has when they type a query into a search engine.", "example": "Understanding user intent helps create more relevant content." },
  { "id": "fc_dm_64", "categoryId": "fc_cat_digital_marketing", "term": "Voice Search Optimization", "definition": "Optimizing your content, website, and online presence for search queries made via voice-activated devices like Siri, Alexa, and Google Assistant.", "example": "Voice search optimization often focuses on natural language and long-tail keywords." },
  { "id": "fc_dm_65", "categoryId": "fc_cat_digital_marketing", "term": "Video Marketing", "definition": "Using video to promote and market your product or service, increase engagement on your digital and social channels, educate your consumers and customers, and reach your audience with a new medium.", "example": "Video marketing is becoming increasingly popular across all platforms." },
  { "id": "fc_dm_66", "categoryId": "fc_cat_digital_marketing", "term": "Content Calendar", "definition": "A schedule that outlines the content a marketer plans to create and share across different platforms.", "example": "Our content calendar helps us stay organized and consistent." },
  { "id": "fc_dm_67", "categoryId": "fc_cat_digital_marketing", "term": "Customer Journey Map", "definition": "A visual representation of the process a customer or prospect goes through to achieve a goal with your company.", "example": "We created a customer journey map to identify pain points." },
  { "id": "fc_dm_68", "categoryId": "fc_cat_digital_marketing", "term": "Inbound Marketing", "definition": "A technique for drawing customers to products and services via content marketing, social media marketing, search engine optimization and branding.", "example": "HubSpot is a major proponent of inbound marketing." },
  { "id": "fc_dm_69", "categoryId": "fc_cat_digital_marketing", "term": "Outbound Marketing", "definition": "Traditional marketing method that involves proactively reaching out to consumers to get them interested in a product (e.g., cold calling, print ads).", "example": "Outbound marketing is often seen as more interruptive than inbound." },
  { "id": "fc_dm_70", "categoryId": "fc_cat_digital_marketing", "term": "Marketing Qualified Lead (MQL)", "definition": "A lead who has indicated interest in what a brand has to offer based on marketing efforts or is otherwise more likely to become a customer than other leads.", "example": "Downloading an ebook can qualify a lead as an MQL." },
  { "id": "fc_dm_71", "categoryId": "fc_cat_digital_marketing", "term": "Sales Qualified Lead (SQL)", "definition": "A prospective customer that has been researched and vetted — first by an organization's marketing department, then by its sales team – and is deemed ready for the next stage in the sales process.", "example": "An MQL becomes an SQL after further qualification by sales." },
  { "id": "fc_dm_72", "categoryId": "fc_cat_digital_marketing", "term": "Lookalike Audience", "definition": "A way to reach new people who are likely to be interested in your business because they're similar to your best existing customers.", "example": "Facebook allows creating lookalike audiences for ad targeting." },
  { "id": "fc_dm_73", "categoryId": "fc_cat_digital_marketing", "term": "Geotargeting", "definition": "Delivering content or advertisements to consumers based on their geographic location.", "example": "Local businesses use geotargeting to reach nearby customers." },
  { "id": "fc_dm_74", "categoryId": "fc_cat_digital_marketing", "term": "User Experience (UX) Writing", "definition": "The practice of crafting UI copy that guides users within a product and helps them interact with it.", "example": "Clear UX writing is essential for intuitive navigation." },
  { "id": "fc_dm_75", "categoryId": "fc_cat_digital_marketing", "term": "Viral Marketing", "definition": "A marketing technique whereby information about a company’s goods or services is spread electronically from person to person.", "example": "Some campaigns go viral unexpectedly." }
]
