
[
  { "id": "fc_dm_1", "categoryId": "fc_cat_digital_marketing", "term": "SEO", "definition": "Search Engine Optimization. The process of improving the quality and quantity of website traffic to a website or a web page from search engines.", "example": "Good SEO is crucial for organic growth." },
  { "id": "fc_dm_2", "categoryId": "fc_cat_digital_marketing", "term": "CTR", "definition": "Click-Through Rate. The ratio of users who click on a specific link to the number of total users who view a page, email, or advertisement.", "example": "The ad campaign had a low CTR." },
  { "id": "fc_dm_3", "categoryId": "fc_cat_digital_marketing", "term": "PPC", "definition": "Pay-Per-Click. An internet advertising model used to drive traffic to websites, in which an advertiser pays a publisher when the ad is clicked.", "example": "They invested heavily in PPC advertising." },
  { "id": "fc_dm_4", "categoryId": "fc_cat_digital_marketing", "term": "Content Marketing", "definition": "A marketing strategy focused on creating and distributing valuable, relevant, and consistent content to attract and retain a clearly defined audience.", "example": "Blogging is a common form of content marketing." },
  { "id": "fc_dm_5", "categoryId": "fc_cat_digital_marketing", "term": "A/B Testing", "definition": "A method of comparing two versions of a webpage or app against each other to determine which one performs better.", "example": "We're A/B testing two different call-to-action buttons." },
  { "id": "fc_dm_6", "categoryId": "fc_cat_digital_marketing", "term": "Conversion Rate", "definition": "The percentage of users who take a desired action (e.g., making a purchase, signing up for a newsletter).", "example": "Improving the landing page design increased the conversion rate." },
  { "id": "fc_dm_7", "categoryId": "fc_cat_digital_marketing", "term": "SERP", "definition": "Search Engine Results Page. The page displayed by a search engine in response to a query by a searcher.", "example": "Our goal is to rank on the first SERP for relevant keywords." },
  { "id": "fc_dm_8", "categoryId": "fc_cat_digital_marketing", "term": "Backlink", "definition": "An incoming hyperlink from one web page to another website.", "example": "High-quality backlinks can improve SEO." },
  { "id": "fc_dm_9", "categoryId": "fc_cat_digital_marketing", "term": "Affiliate Marketing", "definition": "A marketing arrangement by which an online retailer pays commission to an external website for traffic or sales generated from its referrals.", "example": "She earns income through affiliate marketing on her blog." },
  { "id": "fc_dm_10", "categoryId": "fc_cat_digital_marketing", "term": "Email Automation", "definition": "The process of sending targeted, triggered emails to subscribers at specific times or after specific actions.", "example": "Welcome emails are part of our email automation strategy." },
  { "id": "fc_dm_11", "categoryId": "fc_cat_digital_marketing", "term": "Funnel (Marketing)", "definition": "A visual representation of the customer journey, from initial awareness to conversion or purchase.", "example": "We're optimizing each stage of our marketing funnel." },
  { "id": "fc_dm_12", "categoryId": "fc_cat_digital_marketing", "term": "Influencer", "definition": "An individual who has the power to affect purchase decisions of others because of their authority, knowledge, position, or relationship with their audience.", "example": "Partnering with an influencer can expand brand reach." },
  { "id": "fc_dm_13", "categoryId": "fc_cat_digital_marketing", "term": "Lead Generation", "definition": "The process of attracting and converting strangers and prospects into someone who has indicated interest in your company's product or service.", "example": "Our latest webinar was effective for lead generation." },
  { "id": "fc_dm_14", "categoryId": "fc_cat_digital_marketing", "term": "CTA", "definition": "Call to Action. An instruction to the audience designed to provoke an immediate response, usually using an imperative verb such as 'call now', 'find out more' or 'visit a store today'.", "example": "The 'Sign Up Now' button is our main CTA." },
  { "id": "fc_dm_15", "categoryId": "fc_cat_digital_marketing", "term": "Landing Page", "definition": "A standalone web page, created specifically for a marketing or advertising campaign. It’s where a visitor “lands” after they click on a link in an email, or ads from Google, Bing, YouTube, Facebook, Instagram, Twitter, or similar places on the web.", "example": "We created a dedicated landing page for the new product launch." }
]
