
[
  { "id": "fc_it_1", "categoryId": "fc_cat_it", "term": "API", "definition": "Application Programming Interface. A set of rules and protocols for building and interacting with software applications.", "example": "We used the Twitter API to fetch recent tweets." },
  { "id": "fc_it_2", "categoryId": "fc_cat_it", "term": "Cloud Computing", "definition": "The delivery of computing services—including servers, storage, databases, networking, software, analytics, and intelligence—over the Internet (\"the cloud\").", "example": "AWS and Azure are major cloud computing providers." },
  { "id": "fc_it_3", "categoryId": "fc_cat_it", "term": "Algorithm", "definition": "A process or set of rules to be followed in calculations or other problem-solving operations, especially by a computer.", "example": "Sorting algorithms are used to arrange data in a specific order." },
  { "id": "fc_it_4", "categoryId": "fc_cat_it", "term": "Firewall", "definition": "A network security system that monitors and controls incoming and outgoing network traffic based on predetermined security rules.", "example": "The company firewall blocked access to certain websites." },
  { "id": "fc_it_5", "categoryId": "fc_cat_it", "term": "SDK", "definition": "Software Development Kit. A collection of software development tools in one installable package.", "example": "The Android SDK provides tools to build Android applications." },
  { "id": "fc_it_6", "categoryId": "fc_cat_it", "term": "Debugging", "definition": "The process of finding and resolving defects or problems within a computer program.", "example": "Debugging the code took several hours." },
  { "id": "fc_it_7", "categoryId": "fc_cat_it", "term": "Compiler", "definition": "A program that converts instructions into a machine-code or lower-level form so that they can be read and executed by a computer.", "example": "The C++ code was processed by the compiler." },
  { "id": "fc_it_8", "categoryId": "fc_cat_it", "term": "Interpreter", "definition": "A program that directly executes instructions written in a programming or scripting language, without previously compiling them into machine code.", "example": "Python often uses an interpreter." },
  { "id": "fc_it_9", "categoryId": "fc_cat_it", "term": "API Gateway", "definition": "A management tool that sits in front of an API or group of APIs and acts as a single point of entry for all clients.", "example": "The API Gateway handles request routing and authentication." },
  { "id": "fc_it_10", "categoryId": "fc_cat_it", "term": "Load Balancer", "definition": "A device that distributes network or application traffic across a number of servers.", "example": "Load balancers are used to increase capacity and reliability of applications." },
  { "id": "fc_it_11", "categoryId": "fc_cat_it", "term": "DevOps", "definition": "A set of practices that combines software development (Dev) and IT operations (Ops).", "example": "DevOps aims to shorten the systems development life cycle." },
  { "id": "fc_it_12", "categoryId": "fc_cat_it", "term": "Version Control", "definition": "A system that records changes to a file or set of files over time so that you can recall specific versions later.", "example": "Git is a popular version control system." },
  { "id": "fc_it_13", "categoryId": "fc_cat_it", "term": "Database", "definition": "An organized collection of structured information, or data, typically stored electronically in a computer system.", "example": "SQL is a common language for interacting with relational databases." },
  { "id": "fc_it_14", "categoryId": "fc_cat_it", "term": "SaaS", "definition": "Software as a Service. A software distribution model in which a third-party provider hosts applications and makes them available to customers over the Internet.", "example": "Salesforce and Google Workspace are examples of SaaS." },
  { "id": "fc_it_15", "categoryId": "fc_cat_it", "term": "PaaS", "definition": "Platform as a Service. A cloud computing model where a third-party provider delivers hardware and software tools -- usually those needed for application development -- to users over the internet.", "example": "Heroku is a popular PaaS offering." },
  { "id": "fc_it_16", "categoryId": "fc_cat_it", "term": "IaaS", "definition": "Infrastructure as a Service. A cloud computing model that provides virtualized computing resources over the internet.", "example": "DigitalOcean and Linode offer IaaS." },
  { "id": "fc_it_17", "categoryId": "fc_cat_it", "term": "Microservices", "definition": "An architectural style that structures an application as a collection of small, autonomous services.", "example": "Netflix uses a microservices architecture." },
  { "id": "fc_it_18", "categoryId": "fc_cat_it", "term": "Containerization", "definition": "A lightweight alternative to full machine virtualization that involves encapsulating an application in a container with its own operating environment.", "example": "Docker is a popular containerization platform." },
  { "id": "fc_it_19", "categoryId": "fc_cat_it", "term": "Kubernetes", "definition": "An open-source system for automating deployment, scaling, and management of containerized applications.", "example": "Kubernetes is often used to orchestrate Docker containers." },
  { "id": "fc_it_20", "categoryId": "fc_cat_it", "term": "Serverless", "definition": "A cloud computing execution model in which the cloud provider dynamically manages the allocation and provisioning of servers.", "example": "AWS Lambda is a serverless computing service." },
  { "id": "fc_it_21", "categoryId": "fc_cat_it", "term": "CI/CD", "definition": "Continuous Integration/Continuous Delivery (or Deployment). A set of practices for automating the build, test, and deployment of software.", "example": "Jenkins and GitLab CI are popular CI/CD tools." },
  { "id": "fc_it_22", "categoryId": "fc_cat_it", "term": "Agile", "definition": "A project management methodology that emphasizes iterative development, collaboration, and rapid response to change.", "example": "Scrum and Kanban are Agile frameworks." },
  { "id": "fc_it_23", "categoryId": "fc_cat_it", "term": "Scrum", "definition": "An Agile framework for managing complex knowledge work, typically software development.", "example": "Our team follows a two-week Scrum sprint cycle." },
  { "id": "fc_it_24", "categoryId": "fc_cat_it", "term": "TCP/IP", "definition": "Transmission Control Protocol/Internet Protocol. The foundational suite of communication protocols used for the internet.", "example": "Web browsing relies on TCP/IP." },
  { "id": "fc_it_25", "categoryId": "fc_cat_it", "term": "HTTP/HTTPS", "definition": "Hypertext Transfer Protocol / Secure. The protocol used for transmitting web pages over the internet. HTTPS adds a layer of security.", "example": "Modern websites use HTTPS for secure communication." },
  { "id": "fc_it_26", "categoryId": "fc_cat_it", "term": "DNS", "definition": "Domain Name System. The system that translates human-readable domain names (like google.com) into IP addresses.", "example": "DNS resolution is the first step in accessing a website." },
  { "id": "fc_it_27", "categoryId": "fc_cat_it", "term": "IDE", "definition": "Integrated Development Environment. A software application that provides comprehensive facilities to computer programmers for software development.", "example": "VS Code and IntelliJ IDEA are popular IDEs." },
  { "id": "fc_it_28", "categoryId": "fc_cat_it", "term": "VPN", "definition": "Virtual Private Network. A technology that creates a secure and encrypted connection over a less secure network, such as the internet.", "example": "Many companies require employees to use a VPN when working remotely." },
  { "id": "fc_it_29", "categoryId": "fc_cat_it", "term": "Bandwidth", "definition": "The maximum rate of data transfer across a given path.", "example": "High-definition video streaming requires significant bandwidth." },
  { "id": "fc_it_30", "categoryId": "fc_cat_it", "term": "Latency", "definition": "The delay before a transfer of data begins following an instruction for its transfer.", "example": "Low latency is crucial for online gaming." },
  { "id": "fc_it_31", "categoryId": "fc_cat_it", "term": "SQL", "definition": "Structured Query Language. A standard language for managing and manipulating databases.", "example": "We use SQL to query our relational database." },
  { "id": "fc_it_32", "categoryId": "fc_cat_it", "term": "NoSQL", "definition": "A type of database that provides a mechanism for storage and retrieval of data that is modeled in means other than the tabular relations used in relational databases.", "example": "MongoDB is a popular NoSQL database." },
  { "id": "fc_it_33", "categoryId": "fc_cat_it", "term": "JSON", "definition": "JavaScript Object Notation. A lightweight data-interchange format that is easy for humans to read and write and easy for machines to parse and generate.", "example": "APIs often return data in JSON format." },
  { "id": "fc_it_34", "categoryId": "fc_cat_it", "term": "XML", "definition": "Extensible Markup Language. A markup language designed to carry data, not to display data.", "example": "XML is often used for configuration files." },
  { "id": "fc_it_35", "categoryId": "fc_cat_it", "term": "Framework", "definition": "A pre-written set of code that provides a structure for developing software applications.", "example": "React, Angular, and Vue are popular front-end JavaScript frameworks." },
  { "id": "fc_it_36", "categoryId": "fc_cat_it", "term": "Library", "definition": "A collection of pre-written code snippets that can be used to perform common tasks.", "example": "jQuery is a well-known JavaScript library." },
  { "id": "fc_it_37", "categoryId": "fc_cat_it", "term": "Object-Oriented Programming (OOP)", "definition": "A programming paradigm based on the concept of 'objects', which can contain data in the form of fields (often known as attributes or properties) and code in the form of procedures (often known as methods).", "example": "Java and C++ are object-oriented programming languages." },
  { "id": "fc_it_38", "categoryId": "fc_cat_it", "term": "Functional Programming", "definition": "A programming paradigm that treats computation as the evaluation of mathematical functions and avoids changing-state and mutable data.", "example": "Haskell and Lisp are examples of functional programming languages." },
  { "id": "fc_it_39", "categoryId": "fc_cat_it", "term": "Machine Learning", "definition": "A type of artificial intelligence (AI) that allows software applications to become more accurate at predicting outcomes without being explicitly programmed to do so.", "example": "Spam filters use machine learning to identify unwanted emails." },
  { "id": "fc_it_40", "categoryId": "fc_cat_it", "term": "Artificial Intelligence (AI)", "definition": "The simulation of human intelligence processes by machines, especially computer systems.", "example": "AI is used in various fields, from self-driving cars to medical diagnosis." },
  { "id": "fc_it_41", "categoryId": "fc_cat_it", "term": "Big Data", "definition": "Extremely large data sets that may be analyzed computationally to reveal patterns, trends, and associations, especially relating to human behavior and interactions.", "example": "Companies use big data analytics to understand customer behavior." },
  { "id": "fc_it_42", "categoryId": "fc_cat_it", "term": "Data Mining", "definition": "The process of discovering patterns in large data sets involving methods at the intersection of machine learning, statistics, and database systems.", "example": "Data mining can help identify fraudulent transactions." },
  { "id": "fc_it_43", "categoryId": "fc_cat_it", "term": "Cybersecurity", "definition": "The practice of protecting systems, networks, and programs from digital attacks.", "example": "Cybersecurity is crucial for protecting sensitive data." },
  { "id": "fc_it_44", "categoryId": "fc_cat_it", "term": "Encryption", "definition": "The process of converting information or data into a code, especially to prevent unauthorized access.", "example": "HTTPS uses encryption to secure web communication." },
  { "id": "fc_it_45", "categoryId": "fc_cat_it", "term": "Authentication", "definition": "The process of verifying the identity of a user or process.", "example": "Two-factor authentication adds an extra layer of security." },
  { "id": "fc_it_46", "categoryId": "fc_cat_it", "term": "Authorization", "definition": "The process of determining whether an authenticated user has permission to access a specific resource or perform a specific action.", "example": "Role-based access control is a common authorization mechanism." },
  { "id": "fc_it_47", "categoryId": "fc_cat_it", "term": "Open Source", "definition": "Software for which the original source code is made freely available and may be redistributed and modified.", "example": "Linux is a well-known open-source operating system." },
  { "id": "fc_it_48", "categoryId": "fc_cat_it", "term": "Proprietary Software", "definition": "Software that is owned by an individual or a company (usually the one that developed it). There are almost always major restrictions on its use, and its source code is almost always kept secret.", "example": "Microsoft Windows is an example of proprietary software." },
  { "id": "fc_it_49", "categoryId": "fc_cat_it", "term": "Scalability", "definition": "The ability of a system to handle a growing amount of work by adding resources to the system.", "example": "Cloud platforms offer good scalability for applications." },
  { "id": "fc_it_50", "categoryId": "fc_cat_it", "term": "Virtualization", "definition": "The creation of a virtual (rather than actual) version of something, such as an operating system, a server, a storage device, or network resources.", "example": "Virtual machines (VMs) are a common use of virtualization." },
  { "id": "fc_it_51", "categoryId": "fc_cat_it", "term": "Malware", "definition": "Software that is specifically designed to disrupt, damage, or gain unauthorized access to a computer system.", "example": "Viruses, worms, and ransomware are types of malware." },
  { "id": "fc_it_52", "categoryId": "fc_cat_it", "term": "Phishing", "definition": "A type of social engineering attack often used to steal user data, including login credentials and credit card numbers.", "example": "Phishing emails often try to trick users into revealing sensitive information." },
  { "id": "fc_it_53", "categoryId": "fc_cat_it", "term": "User Interface (UI)", "definition": "The means by which the user and a computer system interact, in particular the use of input devices and software.", "example": "A good UI is intuitive and easy to use." },
  { "id": "fc_it_54", "categoryId": "fc_cat_it", "term": "User Experience (UX)", "definition": "The overall experience of a person using a product such as a website or computer application, especially in terms of how easy or pleasing it is to use.", "example": "UX design focuses on creating user-centered products." },
  { "id": "fc_it_55", "categoryId": "fc_cat_it", "term": "Frontend", "definition": "The part of a website or application that the user interacts with directly. It's also known as the client-side.", "example": "HTML, CSS, and JavaScript are key frontend technologies." },
  { "id": "fc_it_56", "categoryId": "fc_cat_it", "term": "Backend", "definition": "The server-side of a website or application, responsible for storing and organizing data, and ensuring everything on the client-side works.", "example": "Node.js, Python (Django/Flask), and Java (Spring) are common backend technologies." },
  { "id": "fc_it_57", "categoryId": "fc_cat_it", "term": "Full Stack", "definition": "A developer or engineer who can handle all the work of databases, servers, systems engineering, and clients.", "example": "A full-stack developer is proficient in both frontend and backend development." },
  { "id": "fc_it_58", "categoryId": "fc_cat_it", "term": "Responsive Design", "definition": "A web design approach that creates dynamic changes to the appearance of a website, depending on the screen size and orientation of the device being used to view it.", "example": "Responsive design ensures a good user experience on desktops, tablets, and mobiles." },
  { "id": "fc_it_59", "categoryId": "fc_cat_it", "term": "Protocol", "definition": "A set of rules governing the exchange or transmission of data between devices.", "example": "HTTP, FTP, and SMTP are common internet protocols." },
  { "id": "fc_it_60", "categoryId": "fc_cat_it", "term": "Caching", "definition": "The process of storing copies of files in a cache, or temporary storage location, so that they can be accessed more quickly.", "example": "Browser caching helps speed up website loading times." },
  { "id": "fc_it_61", "categoryId": "fc_cat_it", "term": "Kernel", "definition": "The core component of an operating system that manages system resources and acts as an interface between hardware and software.", "example": "The Linux kernel is open source." },
  { "id": "fc_it_62", "categoryId": "fc_cat_it", "term": "Command Line Interface (CLI)", "definition": "A text-based user interface (UI) used to view and manage computer files.", "example": "Developers often use the CLI for tasks like running scripts or managing Git repositories." },
  { "id": "fc_it_63", "categoryId": "fc_cat_it", "term": "Graphical User Interface (GUI)", "definition": "A type of user interface that allows users to interact with electronic devices through graphical icons and visual indicators.", "example": "Modern operating systems primarily use a GUI." },
  { "id": "fc_it_64", "categoryId": "fc_cat_it", "term": "Middleware", "definition": "Software that acts as a bridge between an operating system or database and applications, especially on a network.", "example": "Message queue systems are a form of middleware." },
  { "id": "fc_it_65", "categoryId": "fc_cat_it", "term": "Firmware", "definition": "Permanent software programmed into a read-only memory.", "example": "Updating the router's firmware can improve performance and security." },
  { "id": "fc_it_66", "categoryId": "fc_cat_it", "term": "Git", "definition": "A distributed version control system for tracking changes in source code during software development.", "example": "Developers use Git to collaborate on projects and manage code history." },
  { "id": "fc_it_67", "categoryId": "fc_cat_it", "term": "Repository (Repo)", "definition": "A central location in which data is stored and managed, often used in version control systems like Git.", "example": "The project's source code is stored in a GitHub repository." },
  { "id": "fc_it_68", "categoryId": "fc_cat_it", "term": "Branch (Git)", "definition": "A parallel version of a repository, allowing developers to work on different features or fixes independently.", "example": "She created a new branch to work on the user authentication feature." },
  { "id": "fc_it_69", "categoryId": "fc_cat_it", "term": "Merge (Git)", "definition": "The process of combining changes from different branches into a single branch.", "example": "After testing, the feature branch was merged into the main branch." },
  { "id": "fc_it_70", "categoryId": "fc_cat_it", "term": "Pull Request (PR)", "definition": "A proposal to merge a set of changes from one branch into another, often used for code review.", "example": "He opened a pull request for his teammates to review his code." },
  { "id": "fc_it_71", "categoryId": "fc_cat_it", "term": "Commit (Git)", "definition": "A snapshot of changes made to files in a repository at a specific point in time.", "example": "She made a commit after fixing the bug." },
  { "id": "fc_it_72", "categoryId": "fc_cat_it", "term": "Domain-Driven Design (DDD)", "definition": "An approach to software development that focuses on modeling software to match a domain according to input from domain experts.", "example": "DDD helps create software that accurately reflects business processes." },
  { "id": "fc_it_73", "categoryId": "fc_cat_it", "term": "Test-Driven Development (TDD)", "definition": "A software development process where developers write tests before writing the actual code.", "example": "TDD can lead to more robust and maintainable code." },
  { "id": "fc_it_74", "categoryId": "fc_cat_it", "term": "Unit Testing", "definition": "A software testing method by which individual units of source code are tested to determine if they are fit for use.", "example": "Unit tests help catch bugs early in the development cycle." },
  { "id": "fc_it_75", "categoryId": "fc_cat_it", "term": "Integration Testing", "definition": "A level of software testing where individual units are combined and tested as a group.", "example": "Integration testing ensures that different parts of the application work together correctly." }
]
