
[
  { "id": "fc_it_1", "categoryId": "fc_cat_it", "term": "API", "definition": "Application Programming Interface. A set of rules and protocols for building and interacting with software applications.", "example": "We used the Twitter API to fetch recent tweets." },
  { "id": "fc_it_2", "categoryId": "fc_cat_it", "term": "Cloud Computing", "definition": "The delivery of computing services—including servers, storage, databases, networking, software, analytics, and intelligence—over the Internet (\"the cloud\").", "example": "AWS and Azure are major cloud computing providers." },
  { "id": "fc_it_3", "categoryId": "fc_cat_it", "term": "Algorithm", "definition": "A process or set of rules to be followed in calculations or other problem-solving operations, especially by a computer.", "example": "Sorting algorithms are used to arrange data in a specific order." },
  { "id": "fc_it_4", "categoryId": "fc_cat_it", "term": "Firewall", "definition": "A network security system that monitors and controls incoming and outgoing network traffic based on predetermined security rules.", "example": "The company firewall blocked access to certain websites." },
  { "id": "fc_it_5", "categoryId": "fc_cat_it", "term": "SDK", "definition": "Software Development Kit. A collection of software development tools in one installable package.", "example": "The Android SDK provides tools to build Android applications." },
  { "id": "fc_it_6", "categoryId": "fc_cat_it", "term": "Debugging", "definition": "The process of finding and resolving defects or problems within a computer program.", "example": "Debugging the code took several hours." },
  { "id": "fc_it_7", "categoryId": "fc_cat_it", "term": "Compiler", "definition": "A program that converts instructions into a machine-code or lower-level form so that they can be read and executed by a computer.", "example": "The C++ code was processed by the compiler." },
  { "id": "fc_it_8", "categoryId": "fc_cat_it", "term": "Interpreter", "definition": "A program that directly executes instructions written in a programming or scripting language, without previously compiling them into machine code.", "example": "Python often uses an interpreter." },
  { "id": "fc_it_9", "categoryId": "fc_cat_it", "term": "API Gateway", "definition": "A management tool that sits in front of an API or group of APIs and acts as a single point of entry for all clients.", "example": "The API Gateway handles request routing and authentication." },
  { "id": "fc_it_10", "categoryId": "fc_cat_it", "term": "Load Balancer", "definition": "A device that distributes network or application traffic across a number of servers.", "example": "Load balancers are used to increase capacity and reliability of applications." },
  { "id": "fc_it_11", "categoryId": "fc_cat_it", "term": "DevOps", "definition": "A set of practices that combines software development (Dev) and IT operations (Ops).", "example": "DevOps aims to shorten the systems development life cycle." },
  { "id": "fc_it_12", "categoryId": "fc_cat_it", "term": "Version Control", "definition": "A system that records changes to a file or set of files over time so that you can recall specific versions later.", "example": "Git is a popular version control system." },
  { "id": "fc_it_13", "categoryId": "fc_cat_it", "term": "Database", "definition": "An organized collection of structured information, or data, typically stored electronically in a computer system.", "example": "SQL is a common language for interacting with relational databases." },
  { "id": "fc_it_14", "categoryId": "fc_cat_it", "term": "SaaS", "definition": "Software as a Service. A software distribution model in which a third-party provider hosts applications and makes them available to customers over the Internet.", "example": "Salesforce and Google Workspace are examples of SaaS." },
  { "id": "fc_it_15", "categoryId": "fc_cat_it", "term": "PaaS", "definition": "Platform as a Service. A cloud computing model where a third-party provider delivers hardware and software tools -- usually those needed for application development -- to users over the internet.", "example": "Heroku is a popular PaaS offering." }
]
